
## Plan Result (admin)

[CI link](https://github.com/hkak03key/terraform-useful-code/actions/runs/8487869640)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_policy.events_readwrite_sfn_get_events_for_any_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_policy.events_readwrite_sfn_get_events_for_any_rule will be created
  + resource "aws_iam_policy" "events_readwrite_sfn_get_events_for_any_rule" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "events-readwrite-sfn-get-events-for-@-rule"
      + name_prefix = (known after apply)
      + path        = "/global/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "events:PutTargets",
                          + "events:PutRule",
                          + "events:DescribeRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:events:*:***:rule/StepFunctionsGetEventsFor*Rule",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "github_repository" = "https://github.com/hkak03key/terraform-useful-code"
          + "terraform_root"    = "admin"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"ci-terraform","PRNumber":122,"Program":"tfcmt","SHA1":"cec598a57ee80fd62ad4c582bd80054554982c3d","Target":"admin","Vars":{},"WorkflowName":"CI Terraform"} -->